Edited/MeterAddNotification_Request_2.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Header>
		<ns1:MultiSpeakMsgHeader xmlns:ns1="http://www.multispeak.org/Version_3.0" soapenv:actor="http://schemas.xmlsoap.org/soap/actor/next" soapenv:mustUnderstand="0" AppName="" BuildString="" Company="" Pwd="" SessionID="1455549023320" TimeStamp="2016-02-15T15:10:30.662Z" UserID="" Version="3.0"/>
	</soapenv:Header>
	<soapenv:Body>
		<MeterAddNotification xmlns="http://www.multispeak.org/Version_3.0">
			<addedMeters>
				<meter objectID="98157030" verb="New">
					<extensionsList>
						<extensionsItem>
							<extName>xponderNo</extName>
							<extValue>98157030</extValue>
						</extensionsItem>
						<extensionsItem>
							<extName>AMRPort</extName>
							<extValue>0</extValue>
						</extensionsItem>
						<extensionsItem>
							<extName>meterStatus</extName>
							<extValue>1</extValue>
						</extensionsItem>
						<extensionsItem>
							<extName>InternalCD</extName>
							<extValue>true</extValue>
							<extType>boolean</extType>
						</extensionsItem>
						<extensionsItem>
							<extName>rateSchedule</extName>
							<extValue>GVEC+16</extValue>
						</extensionsItem>
						<extensionsItem>
							<extName>rateStartDate</extName>
							<extValue>2016-02-12T00:00:00-06:00</extValue>
							<extType>dateTime</extType>
						</extensionsItem>
						<extensionsItem>
							<extName>positionNumber</extName>
							<extValue>1</extValue>
						</extensionsItem>
						<extensionsItem>
							<extName>readingSeqNbr</extName>
							<extValue>1</extValue>
						</extensionsItem>
						<extensionsItem>
							<extName>readingType</extName>
							<extValue>A</extValue>
						</extensionsItem>
						<extensionsItem>
							<extName>serviceType</extName>
							<extValue>ELEC</extValue>
						</extensionsItem>
						<extensionsItem>
							<extName>netMeterSw</extName>
							<extValue>N</extValue>
						</extensionsItem>
						<extensionsItem>
							<extName>electricUseCd</extName>
							<extValue>0</extValue>
						</extensionsItem>
						<extensionsItem>
							<extName>powerFactor</extName>
							<extValue>0.0</extValue>
						</extensionsItem>
						<extensionsItem>
							<extName>servStatus</extName>
							<extValue>7</extValue>
						</extensionsItem>
					</extensionsList>
					<inServiceDate>2016-02-12T06:00:00.000Z</inServiceDate>
					<facilityID>69622232</facilityID>
					<meterNo>98157030</meterNo>
					<serialNumber/>
					<meterType>0</meterType>
					<manufacturer>LANDIS  GYR</manufacturer>
					<AMRType>DCSI</AMRType>
					<AMRVendor>TWACS</AMRVendor>
					<nameplate>
						<kh>7.2</kh>
						<maxAmperage>200.0</maxAmperage>
						<testAmperage>30.0</testAmperage>
						<wires>3</wires>
						<dials>5</dials>
						<form>2S</form>
						<multiplier>1</multiplier>
						<demandMult>1.0</demandMult>
						<transponderID>98157030</transponderID>
					</nameplate>
					<utilityInfo>
						<district>35</district>
						<servLoc>128126</servLoc>
						<accountNumber>209460001</accountNumber>
						<custID>209460</custID>
						<substationCode>5</substationCode>
						<substationName>WESER</substationName>
						<transformerBankID>T69622232001</transformerBankID>
						<meterBaseID>128126+1</meterBaseID>
					</utilityInfo>
					<meterStatusList>
						<meterStatus>Active</meterStatus>
						<meterStatus>Installed</meterStatus>
					</meterStatusList>
				</meter>
			</addedMeters>
		</MeterAddNotification>
	</soapenv:Body>
</soapenv:Envelope>
